宿題５
関数を使う
sum,count,max等
6問自分で作る。

問１、COUNT関数

In [1]:
import sqlite3
import pandas as pd
con = sqlite3.connect("sakila.db")

In [2]:
sql_query = '''SELECT COUNT(*) FROM customer'''

In [3]:
df = pd.read_sql(sql_query, con)

df

   COUNT(*)
0       599

問２、SUM関数

In [7]:
sql_query2 = '''SELECT SUM(customer_id) FROM customer'''

In [8]:
df2 = pd.read_sql(sql_query2, con)

df2

   SUM(customer_id)
0            179700

問3、MAX関数

In [12]:
sql_query3 = '''SELECT MAX(customer_id), first_name FROM customer'''

In [13]:
df3 = pd.read_sql(sql_query3, con)

df3

   MAX(customer_id) first_name
0               599     AUSTIN

問４、MIN関数

In [17]:
sql_query4 = '''SELECT MIN(customer_id), first_name FROM customer'''

In [18]:
df4 = pd.read_sql(sql_query4, con)

df4

   MIN(customer_id) first_name
0                 1       MARY

問5、LENGTH関数

In [19]:
sql_query5 = '''SELECT LENGTH(country), country FROM country'''

In [21]:
df5 = pd.read_sql(sql_query5, con)

df5

     LENGTH(country)               country
0                 11           Afghanistan
1                  7               Algeria
2                 14        American Samoa
3                  6                Angola
4                  8              Anguilla
..               ...                   ...
104                7               Vietnam
105               20  Virgin Islands, U.S.
106                5                 Yemen
107               10            Yugoslavia
108                6                Zambia

[109 rows x 2 columns]

問6、AVG関数

In [40]:
sql_query6 = '''SELECT AVG(LENGTH(country)) FROM country'''

In [41]:
df6 = pd.read_sql(sql_query6, con)

df6

   AVG(LENGTH(country))
0               8.93578